backend/app/controllers/api/v1/challenges_controller.rb

SELECT "challenges".* FROM "challenges"
---
            def index

               @challenges =  Challenge.all

INSERT INTO "challenges" ("title", "description", "start_date", "end_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
            def create
               # @challenge = Challenge.new(challenge_params.merge(user_id: current_user.id))
                @challenge = current_user.challenges.build(challenge_params)
            #Create single challenge
                if @challenge.save

UPDATE "challenges" SET "description" = $1, "updated_at" = $2 WHERE "challenges"."id" = $3  [["description", "My detailed description"], ["updated_at", "2024-05-10 14:39:53.860784"], ["id", 1]]
---
            def update
            # Update single challenge
                if(@challenge.update(challenge_params))

DELETE FROM "challenges" WHERE "challenges"."id" = $1  [["id", 1]]
---
            def destroy
                #Delete single chanllenge
                if(@challenge.destroy)

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
            def set_challenge
                @challenge = Challenge.find(params[:id])