backend/app/controllers/api/v1/challenges_controller.rb

SELECT "challenges".* FROM "challenges" WHERE (start_date <= '2024-06-04' AND end_date >= '2024-06-04'  )
---
            def active_and_upcoming

                @active_challenges =  Challenge.active
                @upcoming_challenges =  Challenge.upcoming

                @all = Challenge.all

INSERT INTO "challenges" ("title", "description", "start_date", "end_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
            def create
               # @challenge = Challenge.new(challenge_params.merge(user_id: current_user.id))
                @challenge = current_user.challenges.build(challenge_params)
            #Create single challenge
                if @challenge.save

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
            def set_challenge
                @challenge = Challenge.find(params[:id])